---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightKey.#ctor(Autodesk.Revit.DB.ExportLineweightKey)
source: html/a16aa481-cb97-1121-f2c6-b27269782d29.htm
---
# Autodesk.Revit.DB.ExportLineweightKey.#ctor Method

Constructs a new copy of the input ExportLineweightKey object.

## Syntax (C#)
```csharp
public ExportLineweightKey(
	ExportLineweightKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportLineweightKey`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null